content/teaching/2014/dim0436/index.org
# Created 2018-01-04 Thu 16:27
#+TITLE: DIM0436
#+DATE: 2014-02-01
#+AUTHOR: Richard Bonichon
#+MACRO: pdf <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>

* Aulas

|  # | Data         | Título                                        | Material                                                                                                                       |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
|  1 | [20140722]   | Introdução                                    | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter01.pdf][Slides]]                                                                   |
|  2 | [20140724]   | Qualidade de especificação                    | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter02.pdf][Slides]]                                                                   |
|  3 | [20140729]   | Especificações informais                      | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>   [[/dim0436/lectures/01-chapter03.pdf][Slides]]                                                                  |
|  4 | [20140731]   | CFG, DFD                                      | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter04.pdf][Slides]]                                                                   |
|  5 | [20140805]   | UML - I                                       | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter05.pdf][Slides]]                                                                   |
|  6 | [20140807]   | UML - II                                      | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter06.pdf][Slides]]                                                                   |
|  7 | [20140812]   | Autômatos, Redes de Petri                     | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter07.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
|  8 | [20140814]   | Conjuntos, Funções, Relações                  | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter08.pdf][Slides]]                                                                   |
|  9 | [20140820]   | Lógica                                        | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[//dim0436/lectures/01-chapter09.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 10 | [20140822]   | Semântica I                                   | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter10.pdf][Slides]]                                                                   |
| 11 | [20140824]   | Semântica II                                  | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter11.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 12 | [20140830]   | Semântica IIbis                               | idem                                                                                                                           |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 13 | [20140902]   | Tipagem I                                     | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter12.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 14 | [20140904]   | Tipagem II                                    | idem (sem subtipagem)                                                                                                          |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 15 | [20140923]   | Programação por contrato                      | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter15.pdf][Slides]]                                                                   |
| 16 | [20140925]   | Lógica de Hoare                               | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter16.pdf][Slides]], [[/dim0436/exercises/solucoes-wp.pdf][Soluções]]                                                         |
| 17 | [20140930]   | Frama-C                                       | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter17.pdf][Slides]]                                                                   |
| 18 | [20141002]   | Lab 1                                         | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/labs/lab-wp.pdf][Lab]]                                                                       |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 19 | [20141007]   | Lab 2                                         | --                                                                                                                             |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 20 | [20141009]   | Lab 3                                         | --                                                                                                                             |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 21 | [20141014]   | Resolução e método tableaux                   | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter21.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 22 | [20141016]   | **Avaliação I**                               | --                                                                                                                             |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 23 | [20141021]   | DPLL                                          | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter23.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 24 | [20141023]   | Revisões e introdução ao teste                | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter24.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 25 | [20141030]   | Teste de caixa preta                          | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter25.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 26 | [20141104]   | Teste de caixa branca: critérios de cobertura | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter26.pdf][Slides]], <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/exercises/01-exercises26.pdf][ Exercícios]] |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 27 | [20141106]   | Teste de caixa branca: mutações               | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter27.pdf][Slides]],  <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/exercises/02-exercises27.pdf][Exercícios]] |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 28 | [20141111]   | Lab 4                                         | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/labs/lab-caixa_preta.pdf][Lab]], <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/labs/arquivos.tgz][Arquivos]]        |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 29 | [20141113]   | Lab 5                                         | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/labs/lab-whitebox_testing29.pdf][Lab]]                                                                       |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 30 | *[20141115]* | Intepretação abstrata 1                       | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter30.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 31 | [20141118]   | Intepretação abstrata 2                       | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i>  [[/dim0436/lectures/01-chapter31.pdf][Slides]]                                                                   |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 32 | [20141122]   | Lab 6                                         | <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[/dim0436/labs/lab-ai.pdf][Lab]], <i class="fa fa-file-pdf-o" aria-hidden="true"> </i> [[filen:/dim0436/labs/code-ai.tgz][Arquivos]]        |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 33 | [20141125]   | Lab 7                                         | --                                                                                                                             |
|----+--------------+-----------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------|
| 34 | [20141127]   | **Avaliação II**                              | --                                                                                                                             |
| 35 | [20141202]   | Apresentações                                 | --                                                                                                                             |
| 36 | [20141204]   | Apresentações                                 | --                                                                                                                             |
|    |              |                                               |                                                                                                                                |
