teaching/2014/dim0436/index.html
<!DOCTYPE html>
<html lang="en" class="has-navbar-fixed-top" >
  <head>
    <meta charset="utf-8">
<title>RB</title>

<meta name="author" content="RB">


<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">




    <link href="/css/screen.css" media="screen" rel="stylesheet">

<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css"
      rel="stylesheet"
      integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN"
      crossorigin="anonymous">


    <link rel="canonical" href="https://rbonichon.github.io/teaching/2014/dim0436/">
    
    <link href="/rss.xml" type="application/atom+xml"
          rel="alternate" title="RB">
  </head>

  <body>
    <nav class="navbar is-fixed-top is-transparent hidden-print" role="navigation" aria-label="main navigation" >
  <div class="container">
    <div class="navbar-brand">
      <a class="navbar-item " href="/">
        <i class="fa fa-2x fa-home" aria-hidden="true" title="Home">
        </i>
        <span class="sr-only">Home</span>
      </a>
      <button class="button navbar-burger" data-target="navMenu" >
        <span></span>
        <span></span>
        <span></span>
      </button>
    </div>
    
    <div class="navbar-menu" id="navMenu" >
      <div class="navbar-start ">
        <a aria-label="About" class="navbar-item" href="/non-posts/about/">
          <i aria-hidden="true" class="fa fa-2x fa-user" title="About">
          </i>
          <span class="sr-only">About</span>
        </a>
        <a class="navbar-item" href="/non-posts/biblio/">
          <i class="fa fa-2x fa-book" aria-hidden="true" title="Publications">
          </i>
          <span class="sr-only">Publications</span>
        </a>

        <a class="navbar-item" href="/non-posts/teaching/">
          <i class="fa fa-2x fa-graduation-cap" aria-hidden="true" title="Teaching">
          </i>
          <span class="sr-only">Teaching</span>
        </a>
        <a class="navbar-item" href="https://github.com/rbonichon">
          <i class="fa fa-2x fa-github" aria-hidden="true" title="GitHub">
          </i>
          <span class="sr-only">GitHub</span>
        </a>
      </div>
      <div class="navbar-end">
        <a class="navbar-item" href="/non-posts/archives/">
          <i class="fa fa-2x fa-archive" aria-hidden="true" title="Archive">
          </i>
          <span class="sr-only">Archive</span>
        </a>
      </div>
    </div>

  </div>

</nav>

    

    


<section class="section content">
  <div class="container">
    <h1>DIM0436</h1>
    <hr/>
    <div class="columns">
      <div class="column">
        
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Aulas
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<table>
<thead>
<tr>
<th class="align-right">#</th>
<th>Data</th>
<th>Título</th>
<th>Material</th>
</tr>
</thead>
<tbody>
<tr>
<td class="align-right">1</td>
<td>[20140722]</td>
<td>Introdução</td>
<td><a href="/dim0436/lectures/01-chapter01.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">2</td>
<td>[20140724]</td>
<td>Qualidade de especificação</td>
<td><a href="/dim0436/lectures/01-chapter02.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">3</td>
<td>[20140729]</td>
<td>Especificações informais</td>
<td><a href="/dim0436/lectures/01-chapter03.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">4</td>
<td>[20140731]</td>
<td>CFG, DFD</td>
<td><a href="/dim0436/lectures/01-chapter04.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">5</td>
<td>[20140805]</td>
<td>UML - I</td>
<td><a href="/dim0436/lectures/01-chapter05.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">6</td>
<td>[20140807]</td>
<td>UML - II</td>
<td><a href="/dim0436/lectures/01-chapter06.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">7</td>
<td>[20140812]</td>
<td>Autômatos, Redes de Petri</td>
<td><a href="/dim0436/lectures/01-chapter07.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">8</td>
<td>[20140814]</td>
<td>Conjuntos, Funções, Relações</td>
<td><a href="/dim0436/lectures/01-chapter08.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">9</td>
<td>[20140820]</td>
<td>Lógica</td>
<td><a href="//dim0436/lectures/01-chapter09.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">10</td>
<td>[20140822]</td>
<td>Semântica I</td>
<td><a href="/dim0436/lectures/01-chapter10.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">11</td>
<td>[20140824]</td>
<td>Semântica II</td>
<td><a href="/dim0436/lectures/01-chapter11.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">12</td>
<td>[20140830]</td>
<td>Semântica IIbis</td>
<td>idem</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">13</td>
<td>[20140902]</td>
<td>Tipagem I</td>
<td><a href="/dim0436/lectures/01-chapter12.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">14</td>
<td>[20140904]</td>
<td>Tipagem II</td>
<td>idem (sem subtipagem)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">15</td>
<td>[20140923]</td>
<td>Programação por contrato</td>
<td><a href="/dim0436/lectures/01-chapter15.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">16</td>
<td>[20140925]</td>
<td>Lógica de Hoare</td>
<td><a href="/dim0436/lectures/01-chapter16.pdf">Slides</a>, <a href="/dim0436/exercises/solucoes-wp.pdf">Soluções</a></td>
</tr>
<tr>
<td class="align-right">17</td>
<td>[20140930]</td>
<td>Frama-C</td>
<td><a href="/dim0436/lectures/01-chapter17.pdf">Slides</a></td>
</tr>
<tr>
<td class="align-right">18</td>
<td>[20141002]</td>
<td>Lab 1</td>
<td><a href="/dim0436/labs/lab-wp.pdf">Lab</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">19</td>
<td>[20141007]</td>
<td>Lab 2</td>
<td>–</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">20</td>
<td>[20141009]</td>
<td>Lab 3</td>
<td>–</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">21</td>
<td>[20141014]</td>
<td>Resolução e método tableaux</td>
<td><a href="/dim0436/lectures/01-chapter21.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">22</td>
<td>[20141016]</td>
<td><strong><strong>Avaliação I</strong></strong></td>
<td>–</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">23</td>
<td>[20141021]</td>
<td>DPLL</td>
<td><a href="/dim0436/lectures/01-chapter23.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">24</td>
<td>[20141023]</td>
<td>Revisões e introdução ao teste</td>
<td><a href="/dim0436/lectures/01-chapter24.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">25</td>
<td>[20141030]</td>
<td>Teste de caixa preta</td>
<td><a href="/dim0436/lectures/01-chapter25.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">26</td>
<td>[20141104]</td>
<td>Teste de caixa branca: critérios de cobertura</td>
<td><a href="/dim0436/lectures/01-chapter26.pdf">Slides</a>,  <a href="/dim0436/exercises/01-exercises26.pdf"> Exercícios</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">27</td>
<td>[20141106]</td>
<td>Teste de caixa branca: mutações</td>
<td><a href="/dim0436/lectures/01-chapter27.pdf">Slides</a>,   <a href="/dim0436/exercises/02-exercises27.pdf">Exercícios</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">28</td>
<td>[20141111]</td>
<td>Lab 4</td>
<td><a href="/dim0436/labs/lab-caixa_preta.pdf">Lab</a>,  <a href="/dim0436/labs/arquivos.tgz">Arquivos</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">29</td>
<td>[20141113]</td>
<td>Lab 5</td>
<td><a href="/dim0436/labs/lab-whitebox_testing29.pdf">Lab</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">30</td>
<td><strong>[20141115]</strong></td>
<td>Intepretação abstrata 1</td>
<td><a href="/dim0436/lectures/01-chapter30.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">31</td>
<td>[20141118]</td>
<td>Intepretação abstrata 2</td>
<td><a href="/dim0436/lectures/01-chapter31.pdf">Slides</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">32</td>
<td>[20141122]</td>
<td>Lab 6</td>
<td><a href="/dim0436/labs/lab-ai.pdf">Lab</a>,  <a href="filen:/dim0436/labs/code-ai.tgz">Arquivos</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">33</td>
<td>[20141125]</td>
<td>Lab 7</td>
<td>–</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="align-right">34</td>
<td>[20141127]</td>
<td><strong><strong>Avaliação II</strong></strong></td>
<td>–</td>
</tr>
<tr>
<td class="align-right">35</td>
<td>[20141202]</td>
<td>Apresentações</td>
<td>–</td>
</tr>
<tr>
<td class="align-right">36</td>
<td>[20141204]</td>
<td>Apresentações</td>
<td>–</td>
</tr>
</tbody>
</table>
</div>
</div>

      </div>
    </div>
  </div>
</section>

    <footer class="footer">
  <div class="container ">
    <div class="has-text-centered">
      <p> Built with <a href="https://github.com/spf13/hugo">Hugo</a>.</p>
      <p>© Richard Bonichon 2017-2020</p>
    </div>
  </div>
</footer>


  </body>
</html>
